[
  {
    "case_id": 17,
    "case_number": "T.A. 3/2025 Civil (SB)",
    "title": "Mehwish vs Rashida Shaheen Bibi",
    "queries": [
      "Dispute over that transfer competent before High Court",
      "Islamabad High Court property dispute involving that transfer",
      "Mehwish seeks relief about that transfer",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD JUDICIAL DEPARTMENT Mst. Mehwish Versus Mst. Rashida Shaheen Bibi, et"
    ]
  },
  {
    "case_id": 22,
    "case_number": "FERA 2/2025 (DB)",
    "title": "M/s Askari General Insurance Company vs Commisisoner Inland Revenue",
    "queries": [
      "Dispute over federal insurance whether before High Court",
      "Islamabad High Court company dispute involving federal insurance",
      "M/s Askari General Insurance Company seeks relief about federal insurance",
      "Which case discusses Form No: HCJD/C-121. ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. M/s Askari General Insura"
    ]
  },
  {
    "case_id": 26,
    "case_number": "CM Ind. 1/2025 Civil (SB)",
    "title": "AWAIS AHMED SATTI vs SHFQAT NAEEM JANJUA",
    "queries": [
      "AWAIS AHMED SATTI seeks relief about that shops",
      "Application under Section 12 concerning that shops",
      "Dispute over that shops subject before High Court",
      "Islamabad High Court constitutional dispute involving that shops",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD (JUDICIAL DEPARTMENT) Awais Ahmad Satti Versus Shafqat Naeem and othe"
    ]
  },
  {
    "case_id": 35,
    "case_number": "T.A. 2/2025 Civil (SB)",
    "title": "Zaryab Qayyum vs Muhammad Usman Safdar",
    "queries": [
      "Dispute over muhammad zaryab qayyum before High Court",
      "Islamabad High Court family dispute involving muhammad zaryab",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Zaryab Qayyum and another Versus Muhammad Usma",
      "Zaryab Qayyum seeks relief about muhammad zaryab"
    ]
  },
  {
    "case_id": 38,
    "case_number": "Civil Ref. 1/2025 (DB)",
    "title": "vs",
    "queries": [
      "Application under Section 18 concerning civil district",
      "Dispute over civil district appeal before High Court",
      "Islamabad High Court criminal general dispute involving civil district",
      "The President seeks relief about civil district",
      "Which case discusses JUDGMENT SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD Appeals from Islamabad High Court to District Judges (East) & (Wes"
    ]
  },
  {
    "case_id": 43,
    "case_number": "Crl. Org. 3/2025 Writ (SB)",
    "title": "M/S Global Hajj And Umrah Services vs Zulfiqar Haider, Secretary, M/o Religious Affairs & others",
    "queries": [
      "Dispute over that instant writ before High Court",
      "Islamabad High Court constitutional dispute involving that instant",
      "M/S Global Hajj And Umrah Services seeks relief about that instant",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD JUDICIAL DEPARTMENT M/s Global Hajj & Umrah Services VERSUS Federatio"
    ]
  },
  {
    "case_id": 53,
    "case_number": "R.A. 1/2025 Writ (SB)",
    "title": "Moazzam Fareed etc vs FOP",
    "queries": [
      "Dispute over federal applicants that before High Court",
      "Islamabad High Court constitutional dispute involving federal applicants",
      "Moazzam Fareed seeks relief about federal applicants",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Moazam Fareed and another Versus Federation of"
    ]
  },
  {
    "case_id": 56,
    "case_number": "F.A.O. 3/2025 Against Order (SB)",
    "title": "Jamila Munawar vs Wali Ullah",
    "queries": [
      "Dispute over appellant that execution before High Court",
      "Islamabad High Court criminal general dispute involving appellant that",
      "Jamila Munawar seeks relief about appellant that",
      "Which case discusses JUDGMENT SHEET. ISLAMABAD HIGH COURT, ISLAMABAD, JUDICIAL DEPARTMENT. Jamila Munawar Vs. Wali Ullah Appellant by: Mr. Wa"
    ]
  },
  {
    "case_id": 58,
    "case_number": "F.A.O. 2/2025 Against Order (SB)",
    "title": "Haider Waheed vs Bahria Town Pvt Ltd",
    "queries": [
      "Dispute over appellant relief that before High Court",
      "Haider Waheed seeks relief about appellant relief",
      "Islamabad High Court criminal general dispute involving appellant relief",
      "Which case discusses JUDGMENT SHEET ISLAMABAD HIGH COURT, ISLAMABAD JUDICIAL DEPARTMENT Haider Waheed Versus Bahria Town (Private) Limited an"
    ]
  },
  {
    "case_id": 60,
    "case_number": "C.O. 1/2025 Others (SB)",
    "title": "Engro Corporation Limited vs SECP",
    "queries": [
      "Application under Section 37 concerning scheme arrangement",
      "Dispute over scheme arrangement petitioners before High Court",
      "Engro Corporation Limited seeks relief about scheme arrangement",
      "Islamabad High Court company dispute involving scheme arrangement",
      "Which case discusses JUDGMENT SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD (JUDICIAL DEPARTMENT) 1. Engro Corporation Limited. 2. Engro Conne"
    ]
  },
  {
    "case_id": 62,
    "case_number": "Crl. Misc. 2/2025 Bail After Arrest (SB)",
    "title": "Shahzad Waqas vs The State",
    "queries": [
      "Dispute over state advocate that before High Court",
      "Islamabad High Court  dispute involving state advocate",
      "Shahzad Waqas seeks relief about state advocate",
      "Which case discusses Form No: HCJD/C-121 ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Shahzad Waqas. VS The Stat"
    ]
  },
  {
    "case_id": 63,
    "case_number": "W.P. 3/2025 Tax & Banking Tax (SB)",
    "title": "Shaikh Muhammad Pervez vs FOP through Secretary Revenue Division",
    "queries": [
      "Application under Section 4C concerning that federation",
      "Dispute over that federation pakistan before High Court",
      "Islamabad High Court company dispute involving that federation",
      "Shaikh Muhammad Pervez seeks relief about that federation",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Shaikh Mohammad Pervez Vs. Federation of Pakis"
    ]
  },
  {
    "case_id": 67,
    "case_number": "W.P. 2/2025 Tax & Banking Tax (SB)",
    "title": "Fatima Faisal vs FOP through Secretary Revenue Division",
    "queries": [
      "Application under Section 4C concerning that federation",
      "Dispute over that federation pakistan before High Court",
      "Fatima Faisal seeks relief about that federation",
      "Islamabad High Court company dispute involving that federation",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Fatima Faisal Vs. Federation of Pakistan throu"
    ]
  },
  {
    "case_id": 71,
    "case_number": "Crl. Appeal 3/2025 Acquittal Other (SB)",
    "title": "Rida Naheed vs Samar Abbas",
    "queries": [
      "Application under Section 173 concerning that accused",
      "Dispute over that accused complainant before High Court",
      "Islamabad High Court criminal bail dispute involving that accused",
      "Rida Naheed seeks relief about that accused",
      "Which case discusses Form No: HCJD/C-121 ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD JUDICIAL DEPARTMENT Rida Naheed Vs Samar Abbas, e"
    ]
  },
  {
    "case_id": 76,
    "case_number": "OGRA Application 3/2024 (SB)",
    "title": "SNGPL vs Waheed Akhtar Rana & others",
    "queries": [
      "Dispute over that ogra limited before High Court",
      "Islamabad High Court company dispute involving that ogra",
      "SNGPL seeks relief about that ogra",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD (JUDICIAL DEPARTMENT) Sui Northern Gas Pipelines Limited versus Wahee"
    ]
  },
  {
    "case_id": 84,
    "case_number": "T.A. 3/2024 Civil (SB)",
    "title": "Amna binte Naveed vs Shahbaz Mubarak",
    "queries": [
      "Amna binte Naveed seeks relief about that parties",
      "Dispute over that parties applicants before High Court",
      "Islamabad High Court family dispute involving that parties",
      "Which case discusses Form No: HCJD/C-121. ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Amna Binte Naveed Vs Shahb"
    ]
  },
  {
    "case_id": 85,
    "case_number": "OGRA Application 2/2024 (SB)",
    "title": "SNGPL vs Zulfiqar Ali & others",
    "queries": [
      "Dispute over ogra that advocate before High Court",
      "Islamabad High Court company dispute involving ogra that",
      "SNGPL seeks relief about ogra that",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD (JUDICIAL DEPARTMENT) Sui Northern Gas Pipelines Limited versus Zulif"
    ]
  },
  {
    "case_id": 89,
    "case_number": "R.A. 3/2024 Writ (SB)",
    "title": "Muhammad Ramzan vs FOP",
    "queries": [
      "Dispute over muhammad this judicial before High Court",
      "Islamabad High Court  dispute involving muhammad this",
      "Muhammad Ramzan seeks relief about muhammad this",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Muhammad Ramzan Ali Versus Federation of Pakis"
    ]
  },
  {
    "case_id": 94,
    "case_number": "P.S.L.A. 3/2024 Other (SB)",
    "title": "Malik Abdul Majeed Bilal vs Zubair Farooq Khan",
    "queries": [
      "Application under Section 22 concerning that also",
      "Dispute over that also land before High Court",
      "Islamabad High Court criminal general dispute involving that also",
      "Malik Abdul Majeed Bilal seeks relief about that also",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Malik Abdul Majeed Bilal Versus Zubair Farooq"
    ]
  },
  {
    "case_id": 101,
    "case_number": "Crl. Rev. 3/2024 Against Interim Order (SB)",
    "title": "Khatoon Bibi vs Excise Taxation/Appellate Tribunal ICT",
    "queries": [
      "Application under Section 420 concerning bibi excise",
      "Dispute over bibi excise taxation before High Court",
      "Islamabad High Court constitutional dispute involving bibi excise",
      "Khatoon Bibi seeks relief about bibi excise",
      "Which case discusses Form No: HCJD/C-121 ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Khatoon Bibi. VS Excise an"
    ]
  },
  {
    "case_id": 106,
    "case_number": "Crl. Org. 3/2024 Writ (SB)",
    "title": "Walayat Shah vs Anwar Ul Haq",
    "queries": [
      "Dispute over that applicants advocate before High Court",
      "Islamabad High Court criminal general dispute involving that applicants",
      "Walayat Shah seeks relief about that applicants",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Walayat Hussain and others Versus Anwar Ul Haq"
    ]
  },
  {
    "case_id": 107,
    "case_number": "R.A. 2/2024 Writ (SB)",
    "title": "Dr M. Hamid Ali vs FOP",
    "queries": [
      "Dispute over with ministry commerce before High Court",
      "Dr M. Hamid Ali seeks relief about with ministry",
      "Islamabad High Court labour dispute involving with ministry",
      "Which case discusses ORDER SHEET. ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Dr. Muhammad Hamid Ali Vs. Federation of Pakistan and"
    ]
  },
  {
    "case_id": 109,
    "case_number": "Crl. Rev. 2/2024 Illegal Disposession (SB)",
    "title": "Haroon Yousaf vs Ruksana Kanwal",
    "queries": [
      "Dispute over hassan banday rukhsana before High Court",
      "Haroon Yousaf seeks relief about hassan banday",
      "Islamabad High Court  dispute involving hassan banday",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Haroon Yousaf Hassan Banday vs. Rukhsana Kanwal"
    ]
  },
  {
    "case_id": 114,
    "case_number": "Crl. Org. 2/2024 Writ (SB)",
    "title": "Muhammad Fayyaz etc vs Capt Retd Anwar ul Haq",
    "queries": [
      "Dispute over that applicants chief before High Court",
      "Islamabad High Court property dispute involving that applicants",
      "Muhammad Fayyaz seeks relief about that applicants",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Muhammad Fayyaz and others Versus Capt. (Retd."
    ]
  },
  {
    "case_id": 118,
    "case_number": "W.P. 2/2024 Service Other (SB)",
    "title": "Muhammad Ismail vs Estate Office Management",
    "queries": [
      "Dispute over that appeal this before High Court",
      "Islamabad High Court constitutional dispute involving that appeal",
      "Muhammad Ismail seeks relief about that appeal",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Muhammad Ismail VS. Estate Office Management,"
    ]
  },
  {
    "case_id": 120,
    "case_number": "EA 2/2024 (SB)",
    "title": "Muhammad Shoaib Shaheen vs Returning officer",
    "queries": [
      "Application under section 62 concerning appellant that",
      "Dispute over appellant that been before High Court",
      "Islamabad High Court banking dispute involving appellant that",
      "Muhammad Shoaib Shaheen seeks relief about appellant that",
      "Which case discusses ORDER SHEET ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Muhammad Shaoib Shaheen Vs. R.O, etc S. No. of order/"
    ]
  },
  {
    "case_id": 124,
    "case_number": "P.S.L.A. 2/2024 Other (SB)",
    "title": "Muhammad Naeem Shafi vs Raja Muhammad Jan",
    "queries": [
      "Dispute over muhammad raja that before High Court",
      "Islamabad High Court  dispute involving muhammad raja",
      "Muhammad Naeem Shafi seeks relief about muhammad raja",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT Muhammad Naeem Shafi Versus Raja Muhammad Jan,"
    ]
  },
  {
    "case_id": 132,
    "case_number": "SECP Appeal 2/2023 (SB)",
    "title": "M/s Shaukat Marwat Estate & Builders (Pvt.) Ltd vs SECP",
    "queries": [
      "Application under Section 84 concerning that companies",
      "Dispute over that companies appellants before High Court",
      "Islamabad High Court company dispute involving that companies",
      "M/s Shaukat Marwat Estate & Builders (Pvt.) Ltd seeks relief about that companies",
      "Which case discusses JUDGMENT SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD M/s Shaukat Marwat Estates & Builders (Pvt.) Ltd and others Versus"
    ]
  },
  {
    "case_id": 135,
    "case_number": "C.O. 2/2023 Others (SB)",
    "title": "Khurshid Ahmed Qureshi & others vs Live Stock & Dairy Development Board (LDDB) & others",
    "queries": [
      "Dispute over with secp ahmed before High Court",
      "Islamabad High Court company dispute involving with secp",
      "Khurshid Ahmed Qureshi & others seeks relief about with secp",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD (JUDICIAL DEPARTMENT) Khurshid Ahmed Qureshi, and others versus Lives"
    ]
  },
  {
    "case_id": 137,
    "case_number": "R.A. 2/2023 Writ (SB)",
    "title": "Dr. Riffat Yasmin, Ex vs Medical Officer vs FOP through Secretary Ministry of National Health Services Regulations and Coordination, Islamabad",
    "queries": [
      "Dispute over that review representation before High Court",
      "Dr. Riffat Yasmin, Ex seeks relief about that review",
      "Islamabad High Court constitutional dispute involving that review",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT. ISLAMABAD JUDICIAL DEPARTMENT Dr. Riffat Yasmin Vs. Federation of Pakistan etc."
    ]
  },
  {
    "case_id": 151,
    "case_number": "Crl. Org. Cse 1/2025 Othr (SB)",
    "title": "The State vs Rabil Abbasi",
    "queries": [
      "Dispute over with that judicial before High Court",
      "Islamabad High Court criminal bail dispute involving with that",
      "The State seeks relief about with that",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD (JUDICIAL DEPARTMENT) The State versus Rabail Abbas S. No. of order/"
    ]
  },
  {
    "case_id": 152,
    "case_number": "T.A. 1/2025 Civil (SB)",
    "title": "Salim Ahmed vs Zeynab Zafar",
    "queries": [
      "Dispute over that filed guardian before High Court",
      "Islamabad High Court labour dispute involving that filed",
      "Salim Ahmed seeks relief about that filed",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD JUDICIAL DEPARTMENT Salim Ahmed VERSUS Zeynab Zafar, etc Serial No. o"
    ]
  },
  {
    "case_id": 153,
    "case_number": "R.F.A. 1/2025 Against Judgement & Decree (SB)",
    "title": "Muhammad Akhtar vs Musarat Khalil",
    "queries": [
      "Dispute over appellant notice through before High Court",
      "Islamabad High Court criminal general dispute involving appellant notice",
      "Muhammad Akhtar seeks relief about appellant notice",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Muhammad Akthar Vs. Mussarrat Khalil. S. No. o"
    ]
  },
  {
    "case_id": 154,
    "case_number": "CR 1/2025 Against Judgement & Decree (SB)",
    "title": "National Defence University vs Ms. Nadia Asghar",
    "queries": [
      "Dispute over that paracha nadia before High Court",
      "Islamabad High Court criminal general dispute involving that paracha",
      "National Defence University seeks relief about that paracha",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. National Defence University Versus Mst. Nadia A"
    ]
  },
  {
    "case_id": 161,
    "case_number": "W.P. 1/2025 Tax & Banking Tax (SB)",
    "title": "Uneza Jawed vs FOP through Secretary Revenue Division",
    "queries": [
      "Application under Section 4C concerning that federation",
      "Dispute over that federation pakistan before High Court",
      "Islamabad High Court company dispute involving that federation",
      "Uneza Jawed seeks relief about that federation",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Uneza Jawed Vs. Federation of Pakistan through"
    ]
  },
  {
    "case_id": 172,
    "case_number": "Cr.Obj. 1/2024 (SB)",
    "title": "MSF (Medicines Sans Frontiers) and others vs Shahnaz Rafiq and others",
    "queries": [
      "Dispute over that others parties before High Court",
      "Islamabad High Court criminal general dispute involving that others",
      "MSF (Medicines Sans Frontiers) and others seeks relief about that others",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD (JUDICIAL DEPARTMENT) MSF, and others versus Shahnaz Rafiq, and other"
    ]
  },
  {
    "case_id": 173,
    "case_number": "T.A. 1/2024 Civil (SB)",
    "title": "Mujib Ur Rehman Kiani vs Rafaqat Hussain Raja",
    "queries": [
      "Application under Section 35 concerning that this",
      "Dispute over that this with before High Court",
      "Islamabad High Court  dispute involving that this",
      "Mujib Ur Rehman Kiani seeks relief about that this",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Mujib-Ur-Rehman Kiani Versus Rafaqat Hussain R"
    ]
  },
  {
    "case_id": 177,
    "case_number": "C.O. 1/2024 Winding Up Petition (SB)",
    "title": "Muhammad Faraz Ahmed vs SECP and others",
    "queries": [
      "Dispute over address will with before High Court",
      "Islamabad High Court company dispute involving address will",
      "Muhammad Faraz Ahmed seeks relief about address will",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD (JUDICIAL DEPARTMENT) Muhammad Faraz Ahmed versus Securities Exchange"
    ]
  },
  {
    "case_id": 181,
    "case_number": "P.S.L.A. 1/2024 Other (SB)",
    "title": "Mehboob Ali Nasir vs Nasir Mehmood",
    "queries": [
      "Application under 380 PPC concerning that filed",
      "Dispute over that filed impugned before High Court",
      "Islamabad High Court criminal general dispute involving that filed",
      "Mehboob Ali Nasir seeks relief about that filed",
      "Which case discusses Form No: HCJD/C-121 ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD, JUDICIAL DEPARTMENT. Mehboob Ali Nasir Versus N"
    ]
  },
  {
    "case_id": 183,
    "case_number": "R.A. 1/2024 Writ (SB)",
    "title": "Labour Management Services Pvt. Ltd. vs NIRC",
    "queries": [
      "Dispute over that appellant which before High Court",
      "Islamabad High Court property dispute involving that appellant",
      "Labour Management Services Pvt. Ltd seeks relief about that appellant",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD JUDICIAL DEPARTMENT Multan Versus Mst. Noureen Gul and others S. No."
    ]
  },
  {
    "case_id": 185,
    "case_number": "Crl. Rev. 1/2024 Against Interim Order (SB)",
    "title": "Nabeel Mazhar vs Nabeela Kabeer",
    "queries": [
      "Dispute over that been exemption before High Court",
      "Islamabad High Court criminal bail dispute involving that been",
      "Nabeel Mazhar seeks relief about that been",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Nabeel Mazhar Versus Nabeela Kabeer, etc. S. N"
    ]
  },
  {
    "case_id": 189,
    "case_number": "I.T.R. 1/2024 (DB)",
    "title": "Telenor Pakistan Pvt. Ltd. vs Commissioner Inland Revenue, Islamabad",
    "queries": [
      "Application under Section 133 concerning commissioner revenue",
      "Dispute over commissioner revenue whether before High Court",
      "Islamabad High Court company dispute involving commissioner revenue",
      "Telenor Pakistan Pvt. Ltd seeks relief about commissioner revenue",
      "Which case discusses Judgment Sheet IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT Telenor Pakistan (Private) Limited. Versus. C"
    ]
  },
  {
    "case_id": 190,
    "case_number": "Crl. Org. 1/2024 Writ (SB)",
    "title": "Laiba Rauf vs The state",
    "queries": [
      "Dispute over that advocate rauf before High Court",
      "Islamabad High Court  dispute involving that advocate",
      "Laiba Rauf seeks relief about that advocate",
      "Which case discusses ORDER SHEET. ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Laiba Rauf Vs. Professor Doctor Rizwan Taj and others"
    ]
  },
  {
    "case_id": 192,
    "case_number": "CR 1/2024 Against Interim Order (SB)",
    "title": "Waqar Ali Khan etc vs Ch. Faisal Rasheed and others",
    "queries": [
      "Dispute over petitioners that with before High Court",
      "Islamabad High Court criminal general dispute involving petitioners that",
      "Waqar Ali Khan seeks relief about petitioners that",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Waqar Ali Khan, etc. Versus Ch. Faisal Rasheed"
    ]
  },
  {
    "case_id": 193,
    "case_number": "EA 1/2024 (SB)",
    "title": "Muhammad Shoaib Shaheen vs Returning officer",
    "queries": [
      "Application under section 63 concerning officer returning",
      "Dispute over officer returning defect before High Court",
      "Islamabad High Court banking dispute involving officer returning",
      "Muhammad Shoaib Shaheen seeks relief about officer returning",
      "Which case discusses Form No: HCJD/C-121 ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT Muhammad Shoaib Shaheen Vers"
    ]
  },
  {
    "case_id": 194,
    "case_number": "Crl. Misc. 1/2024 Bail Transitory (SB)",
    "title": "Syed Asif Ali Burney vs The State",
    "queries": [
      "Dispute over this bail surety before High Court",
      "Islamabad High Court criminal bail dispute involving this bail",
      "Syed Asif Ali Burney seeks relief about this bail",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Syed Asif Ali Burney Versus The State, etc. S."
    ]
  },
  {
    "case_id": 200,
    "case_number": "C.O.S. 1/2023 Recovery (SB)",
    "title": "MCB vs Adeel Shahbaz",
    "queries": [
      "Dispute over plaintiff settlement agreement before High Court",
      "Islamabad High Court banking dispute involving plaintiff settlement",
      "MCB seeks relief about plaintiff settlement",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. MCB BANK LTD. Versus ADEEL SHAHBAZ STEEL MILLS"
    ]
  },
  {
    "case_id": 235,
    "case_number": "Objection Case 4/2025 Writ (SB)",
    "title": "Noor Fatima & others vs FOP & others",
    "queries": [
      "Dispute over others judicial noor before High Court",
      "Islamabad High Court  dispute involving others judicial",
      "Noor Fatima & others seeks relief about others judicial",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD (JUDICIAL DEPARTMENT) Noor Fatima and others versus Federation of Pak"
    ]
  },
  {
    "case_id": 239,
    "case_number": "C.M. A 5/2025 (SB)",
    "title": "Muhammad Imran vs FOP",
    "queries": [
      "Application under Section 7 concerning years relaxation",
      "Dispute over years relaxation appellant before High Court",
      "Islamabad High Court labour dispute involving years relaxation",
      "Muhammad Imran seeks relief about years relaxation",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD JUDICIAL DEPARTMENT Muhammad Imran Versus Federal Public Service Comm"
    ]
  },
  {
    "case_id": 240,
    "case_number": "C.O. 4/2025 Others (SB)",
    "title": "M/s JC Fintech (Pvt) Ltd etc vs Public at Large",
    "queries": [
      "Dispute over secp that report before High Court",
      "Islamabad High Court company dispute involving secp that",
      "M/s JC Fintech (Pvt) Ltd seeks relief about secp that",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD (JUDICIAL DEPARTMENT) JC Fintech (Private) Limited and another Versus"
    ]
  },
  {
    "case_id": 249,
    "case_number": "Crl. Rev. 5/2025 Against Interim Order (SB)",
    "title": "Imran Ahmed Khan Niazi vs Superintendent Central Jail, Adiala, Rawalpindi",
    "queries": [
      "Dispute over jail with superintendent before High Court",
      "Imran Ahmed Khan Niazi seeks relief about jail with",
      "Islamabad High Court property dispute involving jail with",
      "Which case discusses Form No: HCJD/C-121. ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT Imran Ahmed Khan Niazi Vs S"
    ]
  },
  {
    "case_id": 251,
    "case_number": "C.M. A 4/2025 (SB)",
    "title": "Batoor khan vs Federal Public service Commission",
    "queries": [
      "Batoor khan seeks relief about appellant that",
      "Dispute over appellant that khan before High Court",
      "Islamabad High Court labour dispute involving appellant that",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Batoor Khan Versus The Federal Public Service"
    ]
  },
  {
    "case_id": 255,
    "case_number": "Jail Rev. 4/2025 (SB)",
    "title": "Muhammad Dad vs The State",
    "queries": [
      "Dispute over muhammad state with before High Court",
      "Islamabad High Court  dispute involving muhammad state",
      "Muhammad Dad seeks relief about muhammad state",
      "Which case discusses Form No: HCJD/C-121 ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Muhammad Dad. VS The State"
    ]
  },
  {
    "case_id": 256,
    "case_number": "R.F.A. 5/2025 Against Judgement & Decree (SB)",
    "title": "Comsats University Islamabad vs Gul Aftab Ahmed ec",
    "queries": [
      "Comsats University Islamabad seeks relief about appellant with",
      "Dispute over appellant with amount before High Court",
      "Islamabad High Court property dispute involving appellant with",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. COMSATS University Islamabad Versus Gul Aftab"
    ]
  },
  {
    "case_id": 263,
    "case_number": "Crl. Misc. 5/2025 Bail After Arrest (SB)",
    "title": "Mst. Neelam Bibi vs The State",
    "queries": [
      "Dispute over judicial neelam bibi before High Court",
      "Islamabad High Court  dispute involving judicial neelam",
      "Mst. Neelam Bibi seeks relief about judicial neelam",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Neelam Bibi Versus The State S. No. of order/"
    ]
  },
  {
    "case_id": 264,
    "case_number": "W.P. 4/2025 Tax & Banking Tax (SB)",
    "title": "Shaikh Muhammad Naveed vs FOP through Secretary Revenue Division",
    "queries": [
      "Application under Section 4C concerning that federation",
      "Dispute over that federation pakistan before High Court",
      "Islamabad High Court company dispute involving that federation",
      "Shaikh Muhammad Naveed seeks relief about that federation",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Shaikh Muhammad Naveed Vs. Federation of Pakis"
    ]
  },
  {
    "case_id": 267,
    "case_number": "W.P. 5/2025 Tax & Banking Tax (SB)",
    "title": "Amna Shahzad vs FOP through Secretary Revenue Division",
    "queries": [
      "Amna Shahzad seeks relief about that federation",
      "Application under Section 4C concerning that federation",
      "Dispute over that federation pakistan before High Court",
      "Islamabad High Court company dispute involving that federation",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Amna Shahzad Vs. Federation of Pakistan throug"
    ]
  },
  {
    "case_id": 276,
    "case_number": "R.S.A. 4/2024 Against Judgement (SB)",
    "title": "Rabia Perveen vs Ch. Muhammad Tariq & other",
    "queries": [
      "Application under Section 100 concerning appeal appellant",
      "Dispute over appeal appellant filed before High Court",
      "Islamabad High Court property dispute involving appeal appellant",
      "Rabia Perveen seeks relief about appeal appellant",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. MST. RABIA PARVEEN VS CHAUDHRY MUHAMMAD TARIQ"
    ]
  },
  {
    "case_id": 284,
    "case_number": "OGRA Application 4/2024 (SB)",
    "title": "SNGPL vs Adil Hamid & others",
    "queries": [
      "Dispute over ogra that advocate before High Court",
      "Islamabad High Court company dispute involving ogra that",
      "SNGPL seeks relief about ogra that",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD (JUDICIAL DEPARTMENT) Sui Northern Gas Pipelines Limited versus Zulif"
    ]
  },
  {
    "case_id": 288,
    "case_number": "R.A. 5/2024 Writ (SB)",
    "title": "Azhar Ali vs PIMS",
    "queries": [
      "Azhar Ali seeks relief about that pharmacy",
      "Dispute over that pharmacy khalil before High Court",
      "Islamabad High Court constitutional dispute involving that pharmacy",
      "Which case discusses JUDGMENT SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD (JUDICIAL DEPARTMENT) Azhar Ali Vs. Pakistan Institute of Medical"
    ]
  },
  {
    "case_id": 290,
    "case_number": "T.A. 1/2023 Civil (SB)",
    "title": "Syed Tahreen Fatima vs Jawad Iqbal Dad and another",
    "queries": [
      "Dispute over transfer district that before High Court",
      "Islamabad High Court property dispute involving transfer district",
      "Syed Tahreen Fatima seeks relief about transfer district",
      "Which case discusses Form No: HCJD/C-121. ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT Syed Tahreen Fatima Vs. Jaw"
    ]
  },
  {
    "case_id": 292,
    "case_number": "Crl. Org. 1/2023 Writ (SB)",
    "title": "Nazma Shaheen vs Secretary Ministry of Housing & Works and others",
    "queries": [
      "Application under Section 3 concerning with that",
      "Dispute over with that tariq before High Court",
      "Islamabad High Court property dispute involving with that",
      "Nazma Shaheen seeks relief about with that",
      "Which case discusses Form No: HCJD/C-121 ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. In Nazma Shaheen. VS M. If"
    ]
  },
  {
    "case_id": 294,
    "case_number": "CR 1/2023 Against Interim Order (SB)",
    "title": "Faheem Ahmed Shah vs Muhammad Nabeel and others",
    "queries": [
      "Dispute over that muhammad advocate before High Court",
      "Faheem Ahmed Shah seeks relief about that muhammad",
      "Islamabad High Court labour dispute involving that muhammad",
      "Which case discusses Form No: HCJD/C-121 ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. In Faheem Ahmed Shah. VS M"
    ]
  },
  {
    "case_id": 295,
    "case_number": "Crl. Rev. 1/2023 Against Interim Order (SB)",
    "title": "Ch. Zafar Ali etc vs The State",
    "queries": [
      "Application under Section 265 concerning petitioners another",
      "Ch. Zafar Ali seeks relief about petitioners another",
      "Dispute over petitioners another that before High Court",
      "Islamabad High Court property dispute involving petitioners another",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Ch. Zafar Ali & another Versus The State & ano"
    ]
  },
  {
    "case_id": 297,
    "case_number": "F.A.O. 1/2023 Against Order (SB)",
    "title": "M/s Ghulam Habib & Co. (GHC) Intl. Pvt. Ltd. vs EHFPRO (Pvt.) & others",
    "queries": [
      "Dispute over appellant that muhammad before High Court",
      "Islamabad High Court company dispute involving appellant that",
      "M/s Ghulam Habib & Co. (GHC) Intl. Pvt. Ltd seeks relief about appellant that",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD (JUDICIAL DEPARTMENT) M/s Ghulam Habib and Company (GHC) Internationa"
    ]
  },
  {
    "case_id": 301,
    "case_number": "Crl. Appeal 1/2023 Against Convct. PPC Upto 7 years (SB)",
    "title": "Ghulam Rasool vs Wali Dad Khan",
    "queries": [
      "Dispute over appellant wali khan before High Court",
      "Ghulam Rasool seeks relief about appellant wali",
      "Islamabad High Court criminal general dispute involving appellant wali",
      "Which case discusses Form No: HCJD/C-121 ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Ghulam Rasool. VS Wali Dad"
    ]
  },
  {
    "case_id": 302,
    "case_number": "Crl. Misc. 1/2023 Bail After Arrest (SB)",
    "title": "Naseem Ahmed vs The State",
    "queries": [
      "Application under Section 4 concerning that bail",
      "Dispute over that bail relation before High Court",
      "Islamabad High Court banking dispute involving that bail",
      "Naseem Ahmed seeks relief about that bail",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Naseem Anjum Versus The State & another S. No."
    ]
  },
  {
    "case_id": 303,
    "case_number": "W.P. 1/2023 Tax & Banking Tax (SB)",
    "title": "M/s IESCO vs Additional Commissioner Inland Revenue",
    "queries": [
      "Dispute over that appeal recovery before High Court",
      "Islamabad High Court company dispute involving that appeal",
      "M/s IESCO seeks relief about that appeal",
      "Which case discusses Form No: HCJDIC-LZ1. ORDER SHEET. IN THE ISLAMABAD HI H COURT. ISLAMABAD. JUDICIAL DEPARTMENT. M/s Islamabad Electric Su"
    ]
  },
  {
    "case_id": 313,
    "case_number": "C.O.S. 1/2022 Recovery (SB)",
    "title": "National Bank of Pakistan vs Rawal Institute of Health Science",
    "queries": [
      "Dispute over bank terms parties before High Court",
      "Islamabad High Court  dispute involving bank terms",
      "National Bank of Pakistan seeks relief about bank terms",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. National Bank of Pakistan Vs. M/s Rawal Institu"
    ]
  },
  {
    "case_id": 314,
    "case_number": "C.O. 1/2022 Others (SB)",
    "title": "Kifayat Ullah Khan Bangash etc vs Silk Bank Ltd",
    "queries": [
      "Dispute over khan with others before High Court",
      "Islamabad High Court company dispute involving khan with",
      "Kifayat Ullah Khan Bangash seeks relief about khan with",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD. (JUDICIAL DEPARTMENT) Kifayat Ullah Khan and others versus Silk Bank"
    ]
  },
  {
    "case_id": 320,
    "case_number": "T.A. 1/2022 Civil (SB)",
    "title": "Naseer Chohan vs IDK Ventures",
    "queries": [
      "Application under Section 8 concerning civil that",
      "Dispute over civil that west before High Court",
      "Islamabad High Court labour dispute involving civil that",
      "Naseer Chohan seeks relief about civil that",
      "Which case discusses 4. Learned counsel for the petitioner contended that the parties and subject matter of both the applications are same, t"
    ]
  },
  {
    "case_id": 321,
    "case_number": "SECP Appeal 1/2022 (SB)",
    "title": "Sadruddin Hashwani etc vs SECP",
    "queries": [
      "Application under Section 199 concerning that appellants",
      "Dispute over that appellants within before High Court",
      "Islamabad High Court company dispute involving that appellants",
      "Sadruddin Hashwani seeks relief about that appellants",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. SadruddinHashwani& others Versus The Securitie"
    ]
  },
  {
    "case_id": 322,
    "case_number": "P.S.L.A. 1/2022 Other (SB)",
    "title": "Shahid Amin Minhas vs The State",
    "queries": [
      "Application under section 417 concerning that complaint",
      "Dispute over that complaint under before High Court",
      "Islamabad High Court company dispute involving that complaint",
      "Shahid Amin Minhas seeks relief about that complaint",
      "Which case discusses JUDGMENT SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD JUDICIAL DEPARTMENT Shahid Amin Minhas versus The State and others"
    ]
  },
  {
    "case_id": 328,
    "case_number": "I.C.A. 1/2022 Writ (DB)",
    "title": "Engineer Muhammad Zubair vs FOP",
    "queries": [
      "Application under Section 10 concerning appellant that",
      "Dispute over appellant that civil before High Court",
      "Engineer Muhammad Zubair seeks relief about appellant that",
      "Islamabad High Court constitutional dispute involving appellant that",
      "Which case discusses JUDGMENT SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Engineer Muhammad Zubair Versus Federation"
    ]
  },
  {
    "case_id": 336,
    "case_number": "Crl. Appeal 1/2022 Against Convct. PPC Upto 7 years (DB)",
    "title": "Gul Taj vs The State",
    "queries": [
      "Application under section 173 concerning that appellant",
      "Dispute over that appellant from before High Court",
      "Gul Taj seeks relief about that appellant",
      "Islamabad High Court banking dispute involving that appellant",
      "Which case discusses JUDGMENT SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD JUDICIAL DEPARTMENT Gul Taj Versus The State ===== Appellant By :"
    ]
  },
  {
    "case_id": 337,
    "case_number": "W.P. 1/2022 Misc. Other (SB)",
    "title": "Gezhouba Wah Nobel Blasting Pvt Ltd vs FBR",
    "queries": [
      "Dispute over been advocate appeal before High Court",
      "Gezhouba Wah Nobel Blasting Pvt Ltd seeks relief about been advocate",
      "Islamabad High Court tax dispute involving been advocate",
      "Which case discusses the appeal, pending before the Appellate raised regarding pendency and early disposal of instant petition nor any grieva"
    ]
  },
  {
    "case_id": 343,
    "case_number": "C.M. A 1/2021 (DB)",
    "title": "M/s Utility Stores Corporation of Pakistan vs NICL",
    "queries": [
      "Application under Section 05 concerning appellant plaintiff",
      "Dispute over appellant plaintiff insurance before High Court",
      "Islamabad High Court company dispute involving appellant plaintiff",
      "M/s Utility Stores Corporation of Pakistan seeks relief about appellant plaintiff",
      "Which case discusses plaintiff's Warehouses, situated in different a dacoity took place in the Warehouse of appellant/plaintiff situated in O"
    ]
  },
  {
    "case_id": 348,
    "case_number": "Complaint 1/2021 (LB)",
    "title": "The Registrar, Islamabad High Court, Islamabad vs Naseer Ahmed Kayani, Advocate and others",
    "queries": [
      "Application under section 54 concerning advocate complaint",
      "Dispute over advocate complaint pakistan before High Court",
      "Islamabad High Court constitutional dispute involving advocate complaint",
      "The Registrar, Islamabad High Court, Islamabad seeks relief about advocate complaint",
      "Which case discusses JUDGMENT SHEET ISLAMABAD CASE NO. : The Registrar, Islamabad High Court, Islamabad Vs. Naseer Ahmed Kayani, Advocate and"
    ]
  },
  {
    "case_id": 353,
    "case_number": "E.F.A. 1/2021 Banking (SB)",
    "title": "Mst. Abida Zakir vs Raja Aman Ullah Khan",
    "queries": [
      "Application under section 44 concerning appellant that",
      "Dispute over appellant that raja before High Court",
      "Islamabad High Court criminal general dispute involving appellant that",
      "Mst. Abida Zakir seeks relief about appellant that",
      "Which case discusses ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD JUDICIAL DEPARTMENT Mst. Abida Zakir Versus Raja Aman Ullah Khan and"
    ]
  },
  {
    "case_id": 356,
    "case_number": "CR 1/2021 Against Judgement & Decree (SB)",
    "title": "Muhammad Hafeez etc vs Ali Asghar alias Aksar Khan",
    "queries": [
      "Application under section 9 concerning that under",
      "Dispute over that under suit before High Court",
      "Islamabad High Court constitutional dispute involving that under",
      "Muhammad Hafeez seeks relief about that under",
      "Which case discusses Form No: HCJD/C-121. JUDGEMENT SHEET IN THE ISLAMABADHIGH COURT, ISLAMABAD JUDICIAL DEPARTMENT Dr. Muhammad Hafeez Abbas"
    ]
  },
  {
    "case_id": 359,
    "case_number": "T.A. 1/2021 Civil (SB)",
    "title": "Momina Rafique vs Muhammad Irfan",
    "queries": [
      "Dispute over that form hcjd before High Court",
      "Islamabad High Court property dispute involving that form",
      "Momina Rafique seeks relief about that form",
      "Which case discusses Form No: HCJD/C-121 ORDER SHEET IN THE ISLAMABAD HIGH COURT, ISLAMABAD JUDICIAL DEPARTMENT Momina Rafique Vs Muhammad Ir"
    ]
  },
  {
    "case_id": 363,
    "case_number": "Enfrc. Pet. 1/2021 (SB)",
    "title": "Saul Isreal Radunski vs Shah Zaman Khan",
    "queries": [
      "Application under section 6 concerning limitation under",
      "Dispute over limitation under that before High Court",
      "Islamabad High Court criminal bail dispute involving limitation under",
      "Saul Isreal Radunski seeks relief about limitation under",
      "Which case discusses Form No: HCJD/C-121. JUDGEMENT SHEET IN THE ISLAMABADHIGH COURT, ISLAMABAD JUDICIAL DEPARTMENT Saul Israel Radunski Vs S"
    ]
  },
  {
    "case_id": 364,
    "case_number": "F.A.O. 3/2024 Against Order (SB)",
    "title": "FGEHA vs Aneeza Fatima and another",
    "queries": [
      "Dispute over appellant judicial federal before High Court",
      "FGEHA seeks relief about appellant judicial",
      "Islamabad High Court  dispute involving appellant judicial",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. Federal Government Employees Housing Authority"
    ]
  },
  {
    "case_id": 365,
    "case_number": "R.A. 29/2025 Writ (DB)",
    "title": "ALL PAKISTAN PAPER vs FOP",
    "queries": [
      "ALL PAKISTAN PAPER seeks relief about that with",
      "Application under Section 114 concerning that with",
      "Dispute over that with which before High Court",
      "Islamabad High Court company dispute involving that with",
      "Which case discusses ORDER SHEET. IN THE ISLAMABAD HIGH COURT, ISLAMABAD. JUDICIAL DEPARTMENT. IN HAMDAM PAPER PRODUCTS (PRIVATE) LIMITED, KA"
    ]
  }
]