[
  {
    "case_id": 17,
    "case_number": "T.A. 3/2025 Civil (SB)",
    "title": "Mehwish vs Rashida Shaheen Bibi",
    "queries": [
      "Case involving Mehwish and Rashida Shaheen Bibi in Islamabad High Court",
      "Explain the judgment in Mehwish vs Rashida Shaheen Bibi",
      "High Court ruling on competent within property matters",
      "Islamabad High Court property decision for Mehwish against Rashida Shaheen Bibi",
      "Why did Mehwish approach the court about competent?"
    ]
  },
  {
    "case_id": 22,
    "case_number": "FERA 2/2025 (DB)",
    "title": "M/s Askari General Insurance Company vs Commisisoner Inland Revenue",
    "queries": [
      "Case involving M/s Askari General Insurance Company and Commisisoner Inland Revenue in Islamabad High Court",
      "Explain the judgment in M/s Askari General Insurance Company vs Commisisoner Inland Revenue",
      "High Court ruling on charge within company matters",
      "Islamabad High Court company decision for M/s Askari General Insurance Company against Commisisoner Inland Revenue",
      "Why did M/s Askari General Insurance Company approach the court about charge?"
    ]
  },
  {
    "case_id": 26,
    "case_number": "CM Ind. 1/2025 Civil (SB)",
    "title": "AWAIS AHMED SATTI vs SHFQAT NAEEM JANJUA",
    "queries": [
      "Case involving AWAIS AHMED SATTI and SHFQAT NAEEM JANJUA in Islamabad High Court",
      "Explain the judgment in AWAIS AHMED SATTI vs SHFQAT NAEEM JANJUA",
      "High Court ruling on applicant within constitutional matters",
      "Islamabad High Court constitutional decision for AWAIS AHMED SATTI against SHFQAT NAEEM JANJUA",
      "Why did AWAIS AHMED SATTI approach the court about applicant?"
    ]
  },
  {
    "case_id": 35,
    "case_number": "T.A. 2/2025 Civil (SB)",
    "title": "Zaryab Qayyum vs Muhammad Usman Safdar",
    "queries": [
      "Case involving Zaryab Qayyum and Muhammad Usman Safdar in Islamabad High Court",
      "Explain the judgment in Zaryab Qayyum vs Muhammad Usman Safdar",
      "High Court ruling on islamabad within family matters",
      "Islamabad High Court family decision for Zaryab Qayyum against Muhammad Usman Safdar",
      "Why did Zaryab Qayyum approach the court about islamabad?"
    ]
  },
  {
    "case_id": 38,
    "case_number": "Civil Ref. 1/2025 (DB)",
    "title": "vs",
    "queries": [
      "Case involving The President and The State in Islamabad High Court",
      "Explain the judgment in vs",
      "High Court ruling on appeal within criminal general matters",
      "Islamabad High Court criminal general decision for The President against The State",
      "Why did The President approach the court about appeal?"
    ]
  },
  {
    "case_id": 43,
    "case_number": "Crl. Org. 3/2025 Writ (SB)",
    "title": "M/S Global Hajj And Umrah Services vs Zulfiqar Haider, Secretary, M/o Religious Affairs & others",
    "queries": [
      "Case involving M/S Global Hajj And Umrah Services and Zulfiqar Haider, Secretary, M/o Religious Affairs & others in Islamabad High Court",
      "Explain the judgment in M/S Global Hajj And Umrah Services vs Zulfiqar Haider, Secretary, M/o Religious Affairs & others",
      "High Court ruling on counsel within constitutional matters",
      "Islamabad High Court constitutional decision for M/S Global Hajj And Umrah Services against Zulfiqar Haider, Secretary, M/o Religious Affairs & others",
      "Why did M/S Global Hajj And Umrah Services approach the court about counsel?"
    ]
  },
  {
    "case_id": 53,
    "case_number": "R.A. 1/2025 Writ (SB)",
    "title": "Moazzam Fareed etc vs FOP",
    "queries": [
      "Case involving Moazzam Fareed and FOP in Islamabad High Court",
      "Explain the judgment in Moazzam Fareed etc vs FOP",
      "High Court ruling on applicants within constitutional matters",
      "Islamabad High Court constitutional decision for Moazzam Fareed against FOP",
      "Why did Moazzam Fareed approach the court about applicants?"
    ]
  },
  {
    "case_id": 56,
    "case_number": "F.A.O. 3/2025 Against Order (SB)",
    "title": "Jamila Munawar vs Wali Ullah",
    "queries": [
      "Case involving Jamila Munawar and Wali Ullah in Islamabad High Court",
      "Explain the judgment in Jamila Munawar vs Wali Ullah",
      "High Court ruling on appellant within criminal general matters",
      "Islamabad High Court criminal general decision for Jamila Munawar against Wali Ullah",
      "Why did Jamila Munawar approach the court about appellant?"
    ]
  },
  {
    "case_id": 58,
    "case_number": "F.A.O. 2/2025 Against Order (SB)",
    "title": "Haider Waheed vs Bahria Town Pvt Ltd",
    "queries": [
      "Case involving Haider Waheed and Bahria Town Pvt Ltd in Islamabad High Court",
      "Explain the judgment in Haider Waheed vs Bahria Town Pvt Ltd",
      "High Court ruling on appellant within criminal general matters",
      "Islamabad High Court criminal general decision for Haider Waheed against Bahria Town Pvt Ltd",
      "Why did Haider Waheed approach the court about appellant?"
    ]
  },
  {
    "case_id": 60,
    "case_number": "C.O. 1/2025 Others (SB)",
    "title": "Engro Corporation Limited vs SECP",
    "queries": [
      "Case involving Engro Corporation Limited and SECP in Islamabad High Court",
      "Explain the judgment in Engro Corporation Limited vs SECP",
      "High Court ruling on company within company matters",
      "Islamabad High Court company decision for Engro Corporation Limited against SECP",
      "Why did Engro Corporation Limited approach the court about company?"
    ]
  },
  {
    "case_id": 62,
    "case_number": "Crl. Misc. 2/2025 Bail After Arrest (SB)",
    "title": "Shahzad Waqas vs The State",
    "queries": [
      "Case involving Shahzad Waqas and The State in Islamabad High Court",
      "Explain the judgment in Shahzad Waqas vs The State",
      "Why did Shahzad Waqas approach the court about advocate?"
    ]
  },
  {
    "case_id": 63,
    "case_number": "W.P. 3/2025 Tax & Banking Tax (SB)",
    "title": "Shaikh Muhammad Pervez vs FOP through Secretary Revenue Division",
    "queries": [
      "Case involving Shaikh Muhammad Pervez and FOP through Secretary Revenue Division in Islamabad High Court",
      "Explain the judgment in Shaikh Muhammad Pervez vs FOP through Secretary Revenue Division",
      "High Court ruling on company within company matters",
      "Islamabad High Court company decision for Shaikh Muhammad Pervez against FOP through Secretary Revenue Division",
      "Why did Shaikh Muhammad Pervez approach the court about company?"
    ]
  },
  {
    "case_id": 67,
    "case_number": "W.P. 2/2025 Tax & Banking Tax (SB)",
    "title": "Fatima Faisal vs FOP through Secretary Revenue Division",
    "queries": [
      "Case involving Fatima Faisal and FOP through Secretary Revenue Division in Islamabad High Court",
      "Explain the judgment in Fatima Faisal vs FOP through Secretary Revenue Division",
      "High Court ruling on company within company matters",
      "Islamabad High Court company decision for Fatima Faisal against FOP through Secretary Revenue Division",
      "Why did Fatima Faisal approach the court about company?"
    ]
  },
  {
    "case_id": 71,
    "case_number": "Crl. Appeal 3/2025 Acquittal Other (SB)",
    "title": "Rida Naheed vs Samar Abbas",
    "queries": [
      "Case involving Rida Naheed and Samar Abbas in Islamabad High Court",
      "Explain the judgment in Rida Naheed vs Samar Abbas",
      "High Court ruling on arrest within criminal bail matters",
      "Islamabad High Court criminal bail decision for Rida Naheed against Samar Abbas",
      "Why did Rida Naheed approach the court about arrest?"
    ]
  },
  {
    "case_id": 76,
    "case_number": "OGRA Application 3/2024 (SB)",
    "title": "SNGPL vs Waheed Akhtar Rana & others",
    "queries": [
      "Case involving SNGPL and Waheed Akhtar Rana & others in Islamabad High Court",
      "Explain the judgment in SNGPL vs Waheed Akhtar Rana & others",
      "High Court ruling on company within company matters",
      "Islamabad High Court company decision for SNGPL against Waheed Akhtar Rana & others",
      "Why did SNGPL approach the court about company?"
    ]
  },
  {
    "case_id": 84,
    "case_number": "T.A. 3/2024 Civil (SB)",
    "title": "Amna binte Naveed vs Shahbaz Mubarak",
    "queries": [
      "Case involving Amna binte Naveed and Shahbaz Mubarak in Islamabad High Court",
      "Explain the judgment in Amna binte Naveed vs Shahbaz Mubarak",
      "High Court ruling on applicants within family matters",
      "Islamabad High Court family decision for Amna binte Naveed against Shahbaz Mubarak",
      "Why did Amna binte Naveed approach the court about applicants?"
    ]
  },
  {
    "case_id": 85,
    "case_number": "OGRA Application 2/2024 (SB)",
    "title": "SNGPL vs Zulfiqar Ali & others",
    "queries": [
      "Case involving SNGPL and Zulfiqar Ali & others in Islamabad High Court",
      "Explain the judgment in SNGPL vs Zulfiqar Ali & others",
      "High Court ruling on advocate within company matters",
      "Islamabad High Court company decision for SNGPL against Zulfiqar Ali & others",
      "Why did SNGPL approach the court about advocate?"
    ]
  },
  {
    "case_id": 89,
    "case_number": "R.A. 3/2024 Writ (SB)",
    "title": "Muhammad Ramzan vs FOP",
    "queries": [
      "Case involving Muhammad Ramzan and FOP in Islamabad High Court",
      "Explain the judgment in Muhammad Ramzan vs FOP",
      "Why did Muhammad Ramzan approach the court about applicant?"
    ]
  },
  {
    "case_id": 94,
    "case_number": "P.S.L.A. 3/2024 Other (SB)",
    "title": "Malik Abdul Majeed Bilal vs Zubair Farooq Khan",
    "queries": [
      "Case involving Malik Abdul Majeed Bilal and Zubair Farooq Khan in Islamabad High Court",
      "Explain the judgment in Malik Abdul Majeed Bilal vs Zubair Farooq Khan",
      "High Court ruling on also within criminal general matters",
      "Islamabad High Court criminal general decision for Malik Abdul Majeed Bilal against Zubair Farooq Khan",
      "Why did Malik Abdul Majeed Bilal approach the court about also?"
    ]
  },
  {
    "case_id": 101,
    "case_number": "Crl. Rev. 3/2024 Against Interim Order (SB)",
    "title": "Khatoon Bibi vs Excise Taxation/Appellate Tribunal ICT",
    "queries": [
      "Case involving Khatoon Bibi and Excise Taxation/Appellate Tribunal ICT in Islamabad High Court",
      "Explain the judgment in Khatoon Bibi vs Excise Taxation/Appellate Tribunal ICT",
      "High Court ruling on appellate within constitutional matters",
      "Islamabad High Court constitutional decision for Khatoon Bibi against Excise Taxation/Appellate Tribunal ICT",
      "Why did Khatoon Bibi approach the court about appellate?"
    ]
  },
  {
    "case_id": 106,
    "case_number": "Crl. Org. 3/2024 Writ (SB)",
    "title": "Walayat Shah vs Anwar Ul Haq",
    "queries": [
      "Case involving Walayat Shah and Anwar Ul Haq in Islamabad High Court",
      "Explain the judgment in Walayat Shah vs Anwar Ul Haq",
      "High Court ruling on applicants within criminal general matters",
      "Islamabad High Court criminal general decision for Walayat Shah against Anwar Ul Haq",
      "Why did Walayat Shah approach the court about applicants?"
    ]
  },
  {
    "case_id": 107,
    "case_number": "R.A. 2/2024 Writ (SB)",
    "title": "Dr M. Hamid Ali vs FOP",
    "queries": [
      "Case involving Dr M. Hamid Ali and FOP in Islamabad High Court",
      "Explain the judgment in Dr M. Hamid Ali vs FOP",
      "High Court ruling on along within labour matters",
      "Islamabad High Court labour decision for Dr M. Hamid Ali against FOP",
      "Why did Dr M. Hamid Ali approach the court about along?"
    ]
  },
  {
    "case_id": 109,
    "case_number": "Crl. Rev. 2/2024 Illegal Disposession (SB)",
    "title": "Haroon Yousaf vs Ruksana Kanwal",
    "queries": [
      "Case involving Haroon Yousaf and Ruksana Kanwal in Islamabad High Court",
      "Explain the judgment in Haroon Yousaf vs Ruksana Kanwal",
      "Why did Haroon Yousaf approach the court about another?"
    ]
  },
  {
    "case_id": 114,
    "case_number": "Crl. Org. 2/2024 Writ (SB)",
    "title": "Muhammad Fayyaz etc vs Capt Retd Anwar ul Haq",
    "queries": [
      "Case involving Muhammad Fayyaz and Capt Retd Anwar ul Haq in Islamabad High Court",
      "Explain the judgment in Muhammad Fayyaz etc vs Capt Retd Anwar ul Haq",
      "High Court ruling on applicants within property matters",
      "Islamabad High Court property decision for Muhammad Fayyaz against Capt Retd Anwar ul Haq",
      "Why did Muhammad Fayyaz approach the court about applicants?"
    ]
  },
  {
    "case_id": 118,
    "case_number": "W.P. 2/2024 Service Other (SB)",
    "title": "Muhammad Ismail vs Estate Office Management",
    "queries": [
      "Case involving Muhammad Ismail and Estate Office Management in Islamabad High Court",
      "Explain the judgment in Muhammad Ismail vs Estate Office Management",
      "High Court ruling on appeal within constitutional matters",
      "Islamabad High Court constitutional decision for Muhammad Ismail against Estate Office Management",
      "Why did Muhammad Ismail approach the court about appeal?"
    ]
  },
  {
    "case_id": 120,
    "case_number": "EA 2/2024 (SB)",
    "title": "Muhammad Shoaib Shaheen vs Returning officer",
    "queries": [
      "Case involving Muhammad Shoaib Shaheen and Returning officer in Islamabad High Court",
      "Explain the judgment in Muhammad Shoaib Shaheen vs Returning officer",
      "High Court ruling on appellant within banking matters",
      "Islamabad High Court banking decision for Muhammad Shoaib Shaheen against Returning officer",
      "Why did Muhammad Shoaib Shaheen approach the court about appellant?"
    ]
  },
  {
    "case_id": 124,
    "case_number": "P.S.L.A. 2/2024 Other (SB)",
    "title": "Muhammad Naeem Shafi vs Raja Muhammad Jan",
    "queries": [
      "Case involving Muhammad Naeem Shafi and Raja Muhammad Jan in Islamabad High Court",
      "Explain the judgment in Muhammad Naeem Shafi vs Raja Muhammad Jan",
      "Why did Muhammad Naeem Shafi approach the court about counsel?"
    ]
  },
  {
    "case_id": 132,
    "case_number": "SECP Appeal 2/2023 (SB)",
    "title": "M/s Shaukat Marwat Estate & Builders (Pvt.) Ltd vs SECP",
    "queries": [
      "Case involving M/s Shaukat Marwat Estate & Builders (Pvt.) Ltd and SECP in Islamabad High Court",
      "Explain the judgment in M/s Shaukat Marwat Estate & Builders (Pvt.) Ltd vs SECP",
      "High Court ruling on appellants within company matters",
      "Islamabad High Court company decision for M/s Shaukat Marwat Estate & Builders (Pvt.) Ltd against SECP",
      "Why did M/s Shaukat Marwat Estate & Builders (Pvt.) Ltd approach the court about appellants?"
    ]
  },
  {
    "case_id": 135,
    "case_number": "C.O. 2/2023 Others (SB)",
    "title": "Khurshid Ahmed Qureshi & others vs Live Stock & Dairy Development Board (LDDB) & others",
    "queries": [
      "Case involving Khurshid Ahmed Qureshi & others and Live Stock & Dairy Development Board (LDDB) & others in Islamabad High Court",
      "Explain the judgment in Khurshid Ahmed Qureshi & others vs Live Stock & Dairy Development Board (LDDB) & others",
      "High Court ruling on ahmed within company matters",
      "Islamabad High Court company decision for Khurshid Ahmed Qureshi & others against Live Stock & Dairy Development Board (LDDB) & others",
      "Why did Khurshid Ahmed Qureshi & others approach the court about ahmed?"
    ]
  },
  {
    "case_id": 137,
    "case_number": "R.A. 2/2023 Writ (SB)",
    "title": "Dr. Riffat Yasmin, Ex vs Medical Officer vs FOP through Secretary Ministry of National Health Services Regulations and Coordination, Islamabad",
    "queries": [
      "Case involving Dr. Riffat Yasmin, Ex and Medical Officer in Islamabad High Court",
      "Explain the judgment in Dr. Riffat Yasmin, Ex vs Medical Officer vs FOP through Secretary Ministry of National Health Services Regulations and Coordination, Islamabad",
      "High Court ruling on article 199 within constitutional matters",
      "Islamabad High Court constitutional decision for Dr. Riffat Yasmin, Ex against Medical Officer",
      "Why did Dr. Riffat Yasmin, Ex approach the court about article 199?"
    ]
  },
  {
    "case_id": 151,
    "case_number": "Crl. Org. Cse 1/2025 Othr (SB)",
    "title": "The State vs Rabil Abbasi",
    "queries": [
      "Case involving The State and Rabil Abbasi in Islamabad High Court",
      "Explain the judgment in The State vs Rabil Abbasi",
      "High Court ruling on bail within criminal bail matters",
      "Islamabad High Court criminal bail decision for The State against Rabil Abbasi",
      "Why did The State approach the court about bail?"
    ]
  },
  {
    "case_id": 152,
    "case_number": "T.A. 1/2025 Civil (SB)",
    "title": "Salim Ahmed vs Zeynab Zafar",
    "queries": [
      "Case involving Salim Ahmed and Zeynab Zafar in Islamabad High Court",
      "Explain the judgment in Salim Ahmed vs Zeynab Zafar",
      "High Court ruling on appointment within labour matters",
      "Islamabad High Court labour decision for Salim Ahmed against Zeynab Zafar",
      "Why did Salim Ahmed approach the court about appointment?"
    ]
  },
  {
    "case_id": 153,
    "case_number": "R.F.A. 1/2025 Against Judgement & Decree (SB)",
    "title": "Muhammad Akhtar vs Musarat Khalil",
    "queries": [
      "Case involving Muhammad Akhtar and Musarat Khalil in Islamabad High Court",
      "Explain the judgment in Muhammad Akhtar vs Musarat Khalil",
      "High Court ruling on appellant within criminal general matters",
      "Islamabad High Court criminal general decision for Muhammad Akhtar against Musarat Khalil",
      "Why did Muhammad Akhtar approach the court about appellant?"
    ]
  },
  {
    "case_id": 154,
    "case_number": "CR 1/2025 Against Judgement & Decree (SB)",
    "title": "National Defence University vs Ms. Nadia Asghar",
    "queries": [
      "Case involving National Defence University and Ms. Nadia Asghar in Islamabad High Court",
      "Explain the judgment in National Defence University vs Ms. Nadia Asghar",
      "High Court ruling on advocate within criminal general matters",
      "Islamabad High Court criminal general decision for National Defence University against Ms. Nadia Asghar",
      "Why did National Defence University approach the court about advocate?"
    ]
  },
  {
    "case_id": 161,
    "case_number": "W.P. 1/2025 Tax & Banking Tax (SB)",
    "title": "Uneza Jawed vs FOP through Secretary Revenue Division",
    "queries": [
      "Case involving Uneza Jawed and FOP through Secretary Revenue Division in Islamabad High Court",
      "Explain the judgment in Uneza Jawed vs FOP through Secretary Revenue Division",
      "High Court ruling on company within company matters",
      "Islamabad High Court company decision for Uneza Jawed against FOP through Secretary Revenue Division",
      "Why did Uneza Jawed approach the court about company?"
    ]
  },
  {
    "case_id": 172,
    "case_number": "Cr.Obj. 1/2024 (SB)",
    "title": "MSF (Medicines Sans Frontiers) and others vs Shahnaz Rafiq and others",
    "queries": [
      "Case involving MSF (Medicines Sans Frontiers) and others and Shahnaz Rafiq and others in Islamabad High Court",
      "Explain the judgment in MSF (Medicines Sans Frontiers) and others vs Shahnaz Rafiq and others",
      "High Court ruling on date within criminal general matters",
      "Islamabad High Court criminal general decision for MSF (Medicines Sans Frontiers) and others against Shahnaz Rafiq and others",
      "Why did MSF (Medicines Sans Frontiers) and others approach the court about date?"
    ]
  },
  {
    "case_id": 173,
    "case_number": "T.A. 1/2024 Civil (SB)",
    "title": "Mujib Ur Rehman Kiani vs Rafaqat Hussain Raja",
    "queries": [
      "Case involving Mujib Ur Rehman Kiani and Rafaqat Hussain Raja in Islamabad High Court",
      "Explain the judgment in Mujib Ur Rehman Kiani vs Rafaqat Hussain Raja",
      "Why did Mujib Ur Rehman Kiani approach the court about applicant?"
    ]
  },
  {
    "case_id": 177,
    "case_number": "C.O. 1/2024 Winding Up Petition (SB)",
    "title": "Muhammad Faraz Ahmed vs SECP and others",
    "queries": [
      "Case involving Muhammad Faraz Ahmed and SECP and others in Islamabad High Court",
      "Explain the judgment in Muhammad Faraz Ahmed vs SECP and others",
      "High Court ruling on address within company matters",
      "Islamabad High Court company decision for Muhammad Faraz Ahmed against SECP and others",
      "Why did Muhammad Faraz Ahmed approach the court about address?"
    ]
  },
  {
    "case_id": 181,
    "case_number": "P.S.L.A. 1/2024 Other (SB)",
    "title": "Mehboob Ali Nasir vs Nasir Mehmood",
    "queries": [
      "Case involving Mehboob Ali Nasir and Nasir Mehmood in Islamabad High Court",
      "Explain the judgment in Mehboob Ali Nasir vs Nasir Mehmood",
      "High Court ruling on acquittal within criminal general matters",
      "Islamabad High Court criminal general decision for Mehboob Ali Nasir against Nasir Mehmood",
      "Why did Mehboob Ali Nasir approach the court about acquittal?"
    ]
  },
  {
    "case_id": 183,
    "case_number": "R.A. 1/2024 Writ (SB)",
    "title": "Labour Management Services Pvt. Ltd. vs NIRC",
    "queries": [
      "Case involving Labour Management Services Pvt. Ltd and NIRC in Islamabad High Court",
      "Explain the judgment in Labour Management Services Pvt. Ltd. vs NIRC",
      "High Court ruling on appellant within property matters",
      "Islamabad High Court property decision for Labour Management Services Pvt. Ltd against NIRC",
      "Why did Labour Management Services Pvt. Ltd approach the court about appellant?"
    ]
  },
  {
    "case_id": 185,
    "case_number": "Crl. Rev. 1/2024 Against Interim Order (SB)",
    "title": "Nabeel Mazhar vs Nabeela Kabeer",
    "queries": [
      "Case involving Nabeel Mazhar and Nabeela Kabeer in Islamabad High Court",
      "Explain the judgment in Nabeel Mazhar vs Nabeela Kabeer",
      "High Court ruling on arrest within criminal bail matters",
      "Islamabad High Court criminal bail decision for Nabeel Mazhar against Nabeela Kabeer",
      "Why did Nabeel Mazhar approach the court about arrest?"
    ]
  },
  {
    "case_id": 189,
    "case_number": "I.T.R. 1/2024 (DB)",
    "title": "Telenor Pakistan Pvt. Ltd. vs Commissioner Inland Revenue, Islamabad",
    "queries": [
      "Case involving Telenor Pakistan Pvt. Ltd and Commissioner Inland Revenue, Islamabad in Islamabad High Court",
      "Explain the judgment in Telenor Pakistan Pvt. Ltd. vs Commissioner Inland Revenue, Islamabad",
      "High Court ruling on charge within company matters",
      "Islamabad High Court company decision for Telenor Pakistan Pvt. Ltd against Commissioner Inland Revenue, Islamabad",
      "Why did Telenor Pakistan Pvt. Ltd approach the court about charge?"
    ]
  },
  {
    "case_id": 190,
    "case_number": "Crl. Org. 1/2024 Writ (SB)",
    "title": "Laiba Rauf vs The state",
    "queries": [
      "Case involving Laiba Rauf and The state in Islamabad High Court",
      "Explain the judgment in Laiba Rauf vs The state",
      "Why did Laiba Rauf approach the court about advocate?"
    ]
  },
  {
    "case_id": 192,
    "case_number": "CR 1/2024 Against Interim Order (SB)",
    "title": "Waqar Ali Khan etc vs Ch. Faisal Rasheed and others",
    "queries": [
      "Case involving Waqar Ali Khan and Ch. Faisal Rasheed and others in Islamabad High Court",
      "Explain the judgment in Waqar Ali Khan etc vs Ch. Faisal Rasheed and others",
      "High Court ruling on been within criminal general matters",
      "Islamabad High Court criminal general decision for Waqar Ali Khan against Ch. Faisal Rasheed and others",
      "Why did Waqar Ali Khan approach the court about been?"
    ]
  },
  {
    "case_id": 193,
    "case_number": "EA 1/2024 (SB)",
    "title": "Muhammad Shoaib Shaheen vs Returning officer",
    "queries": [
      "Case involving Muhammad Shoaib Shaheen and Returning officer in Islamabad High Court",
      "Explain the judgment in Muhammad Shoaib Shaheen vs Returning officer",
      "High Court ruling on constitutional within banking matters",
      "Islamabad High Court banking decision for Muhammad Shoaib Shaheen against Returning officer",
      "Why did Muhammad Shoaib Shaheen approach the court about constitutional?"
    ]
  },
  {
    "case_id": 194,
    "case_number": "Crl. Misc. 1/2024 Bail Transitory (SB)",
    "title": "Syed Asif Ali Burney vs The State",
    "queries": [
      "Case involving Syed Asif Ali Burney and The State in Islamabad High Court",
      "Explain the judgment in Syed Asif Ali Burney vs The State",
      "High Court ruling on arrest within criminal bail matters",
      "Islamabad High Court criminal bail decision for Syed Asif Ali Burney against The State",
      "Why did Syed Asif Ali Burney approach the court about arrest?"
    ]
  },
  {
    "case_id": 200,
    "case_number": "C.O.S. 1/2023 Recovery (SB)",
    "title": "MCB vs Adeel Shahbaz",
    "queries": [
      "Case involving MCB and Adeel Shahbaz in Islamabad High Court",
      "Explain the judgment in MCB vs Adeel Shahbaz",
      "High Court ruling on adeel within banking matters",
      "Islamabad High Court banking decision for MCB against Adeel Shahbaz",
      "Why did MCB approach the court about adeel?"
    ]
  },
  {
    "case_id": 235,
    "case_number": "Objection Case 4/2025 Writ (SB)",
    "title": "Noor Fatima & others vs FOP & others",
    "queries": [
      "Case involving Noor Fatima & others and FOP & others in Islamabad High Court",
      "Explain the judgment in Noor Fatima & others vs FOP & others",
      "Why did Noor Fatima & others approach the court about department?"
    ]
  },
  {
    "case_id": 239,
    "case_number": "C.M. A 5/2025 (SB)",
    "title": "Muhammad Imran vs FOP",
    "queries": [
      "Case involving Muhammad Imran and FOP in Islamabad High Court",
      "Explain the judgment in Muhammad Imran vs FOP",
      "High Court ruling on appellant within labour matters",
      "Islamabad High Court labour decision for Muhammad Imran against FOP",
      "Why did Muhammad Imran approach the court about appellant?"
    ]
  },
  {
    "case_id": 240,
    "case_number": "C.O. 4/2025 Others (SB)",
    "title": "M/s JC Fintech (Pvt) Ltd etc vs Public at Large",
    "queries": [
      "Case involving M/s JC Fintech (Pvt) Ltd and Public at Large in Islamabad High Court",
      "Explain the judgment in M/s JC Fintech (Pvt) Ltd etc vs Public at Large",
      "High Court ruling on arrangement within company matters",
      "Islamabad High Court company decision for M/s JC Fintech (Pvt) Ltd against Public at Large",
      "Why did M/s JC Fintech (Pvt) Ltd approach the court about arrangement?"
    ]
  },
  {
    "case_id": 249,
    "case_number": "Crl. Rev. 5/2025 Against Interim Order (SB)",
    "title": "Imran Ahmed Khan Niazi vs Superintendent Central Jail, Adiala, Rawalpindi",
    "queries": [
      "Case involving Imran Ahmed Khan Niazi and Superintendent Central Jail, Adiala, Rawalpindi in Islamabad High Court",
      "Explain the judgment in Imran Ahmed Khan Niazi vs Superintendent Central Jail, Adiala, Rawalpindi",
      "High Court ruling on adiala within property matters",
      "Islamabad High Court property decision for Imran Ahmed Khan Niazi against Superintendent Central Jail, Adiala, Rawalpindi",
      "Why did Imran Ahmed Khan Niazi approach the court about adiala?"
    ]
  },
  {
    "case_id": 251,
    "case_number": "C.M. A 4/2025 (SB)",
    "title": "Batoor khan vs Federal Public service Commission",
    "queries": [
      "Case involving Batoor khan and Federal Public service Commission in Islamabad High Court",
      "Explain the judgment in Batoor khan vs Federal Public service Commission",
      "High Court ruling on appellant within labour matters",
      "Islamabad High Court labour decision for Batoor khan against Federal Public service Commission",
      "Why did Batoor khan approach the court about appellant?"
    ]
  },
  {
    "case_id": 255,
    "case_number": "Jail Rev. 4/2025 (SB)",
    "title": "Muhammad Dad vs The State",
    "queries": [
      "Case involving Muhammad Dad and The State in Islamabad High Court",
      "Explain the judgment in Muhammad Dad vs The State",
      "Why did Muhammad Dad approach the court about counsel?"
    ]
  },
  {
    "case_id": 256,
    "case_number": "R.F.A. 5/2025 Against Judgement & Decree (SB)",
    "title": "Comsats University Islamabad vs Gul Aftab Ahmed ec",
    "queries": [
      "Case involving Comsats University Islamabad and Gul Aftab Ahmed ec in Islamabad High Court",
      "Explain the judgment in Comsats University Islamabad vs Gul Aftab Ahmed ec",
      "High Court ruling on amount within property matters",
      "Islamabad High Court property decision for Comsats University Islamabad against Gul Aftab Ahmed ec",
      "Why did Comsats University Islamabad approach the court about amount?"
    ]
  },
  {
    "case_id": 263,
    "case_number": "Crl. Misc. 5/2025 Bail After Arrest (SB)",
    "title": "Mst. Neelam Bibi vs The State",
    "queries": [
      "Case involving Mst. Neelam Bibi and The State in Islamabad High Court",
      "Explain the judgment in Mst. Neelam Bibi vs The State",
      "Why did Mst. Neelam Bibi approach the court about counsel?"
    ]
  },
  {
    "case_id": 264,
    "case_number": "W.P. 4/2025 Tax & Banking Tax (SB)",
    "title": "Shaikh Muhammad Naveed vs FOP through Secretary Revenue Division",
    "queries": [
      "Case involving Shaikh Muhammad Naveed and FOP through Secretary Revenue Division in Islamabad High Court",
      "Explain the judgment in Shaikh Muhammad Naveed vs FOP through Secretary Revenue Division",
      "High Court ruling on company within company matters",
      "Islamabad High Court company decision for Shaikh Muhammad Naveed against FOP through Secretary Revenue Division",
      "Why did Shaikh Muhammad Naveed approach the court about company?"
    ]
  },
  {
    "case_id": 267,
    "case_number": "W.P. 5/2025 Tax & Banking Tax (SB)",
    "title": "Amna Shahzad vs FOP through Secretary Revenue Division",
    "queries": [
      "Case involving Amna Shahzad and FOP through Secretary Revenue Division in Islamabad High Court",
      "Explain the judgment in Amna Shahzad vs FOP through Secretary Revenue Division",
      "High Court ruling on company within company matters",
      "Islamabad High Court company decision for Amna Shahzad against FOP through Secretary Revenue Division",
      "Why did Amna Shahzad approach the court about company?"
    ]
  },
  {
    "case_id": 276,
    "case_number": "R.S.A. 4/2024 Against Judgement (SB)",
    "title": "Rabia Perveen vs Ch. Muhammad Tariq & other",
    "queries": [
      "Case involving Rabia Perveen and Ch. Muhammad Tariq & other in Islamabad High Court",
      "Explain the judgment in Rabia Perveen vs Ch. Muhammad Tariq & other",
      "High Court ruling on appeal within property matters",
      "Islamabad High Court property decision for Rabia Perveen against Ch. Muhammad Tariq & other",
      "Why did Rabia Perveen approach the court about appeal?"
    ]
  },
  {
    "case_id": 284,
    "case_number": "OGRA Application 4/2024 (SB)",
    "title": "SNGPL vs Adil Hamid & others",
    "queries": [
      "Case involving SNGPL and Adil Hamid & others in Islamabad High Court",
      "Explain the judgment in SNGPL vs Adil Hamid & others",
      "High Court ruling on company within company matters",
      "Islamabad High Court company decision for SNGPL against Adil Hamid & others",
      "Why did SNGPL approach the court about company?"
    ]
  },
  {
    "case_id": 288,
    "case_number": "R.A. 5/2024 Writ (SB)",
    "title": "Azhar Ali vs PIMS",
    "queries": [
      "Case involving Azhar Ali and PIMS in Islamabad High Court",
      "Explain the judgment in Azhar Ali vs PIMS",
      "High Court ruling on been within constitutional matters",
      "Islamabad High Court constitutional decision for Azhar Ali against PIMS",
      "Why did Azhar Ali approach the court about been?"
    ]
  },
  {
    "case_id": 290,
    "case_number": "T.A. 1/2023 Civil (SB)",
    "title": "Syed Tahreen Fatima vs Jawad Iqbal Dad and another",
    "queries": [
      "Case involving Syed Tahreen Fatima and Jawad Iqbal Dad and another in Islamabad High Court",
      "Explain the judgment in Syed Tahreen Fatima vs Jawad Iqbal Dad and another",
      "High Court ruling on applicant within property matters",
      "Islamabad High Court property decision for Syed Tahreen Fatima against Jawad Iqbal Dad and another",
      "Why did Syed Tahreen Fatima approach the court about applicant?"
    ]
  },
  {
    "case_id": 292,
    "case_number": "Crl. Org. 1/2023 Writ (SB)",
    "title": "Nazma Shaheen vs Secretary Ministry of Housing & Works and others",
    "queries": [
      "Case involving Nazma Shaheen and Secretary Ministry of Housing & Works and others in Islamabad High Court",
      "Explain the judgment in Nazma Shaheen vs Secretary Ministry of Housing & Works and others",
      "High Court ruling on counsel within property matters",
      "Islamabad High Court property decision for Nazma Shaheen against Secretary Ministry of Housing & Works and others",
      "Why did Nazma Shaheen approach the court about counsel?"
    ]
  },
  {
    "case_id": 294,
    "case_number": "CR 1/2023 Against Interim Order (SB)",
    "title": "Faheem Ahmed Shah vs Muhammad Nabeel and others",
    "queries": [
      "Case involving Faheem Ahmed Shah and Muhammad Nabeel and others in Islamabad High Court",
      "Explain the judgment in Faheem Ahmed Shah vs Muhammad Nabeel and others",
      "High Court ruling on application within labour matters",
      "Islamabad High Court labour decision for Faheem Ahmed Shah against Muhammad Nabeel and others",
      "Why did Faheem Ahmed Shah approach the court about application?"
    ]
  },
  {
    "case_id": 295,
    "case_number": "Crl. Rev. 1/2023 Against Interim Order (SB)",
    "title": "Ch. Zafar Ali etc vs The State",
    "queries": [
      "Case involving Ch. Zafar Ali and The State in Islamabad High Court",
      "Explain the judgment in Ch. Zafar Ali etc vs The State",
      "High Court ruling on another within property matters",
      "Islamabad High Court property decision for Ch. Zafar Ali against The State",
      "Why did Ch. Zafar Ali approach the court about another?"
    ]
  },
  {
    "case_id": 297,
    "case_number": "F.A.O. 1/2023 Against Order (SB)",
    "title": "M/s Ghulam Habib & Co. (GHC) Intl. Pvt. Ltd. vs EHFPRO (Pvt.) & others",
    "queries": [
      "Case involving M/s Ghulam Habib & Co. (GHC) Intl. Pvt. Ltd and EHFPRO (Pvt.) & others in Islamabad High Court",
      "Explain the judgment in M/s Ghulam Habib & Co. (GHC) Intl. Pvt. Ltd. vs EHFPRO (Pvt.) & others",
      "High Court ruling on appellant within company matters",
      "Islamabad High Court company decision for M/s Ghulam Habib & Co. (GHC) Intl. Pvt. Ltd against EHFPRO (Pvt.) & others",
      "Why did M/s Ghulam Habib & Co. (GHC) Intl. Pvt. Ltd approach the court about appellant?"
    ]
  },
  {
    "case_id": 301,
    "case_number": "Crl. Appeal 1/2023 Against Convct. PPC Upto 7 years (SB)",
    "title": "Ghulam Rasool vs Wali Dad Khan",
    "queries": [
      "Case involving Ghulam Rasool and Wali Dad Khan in Islamabad High Court",
      "Explain the judgment in Ghulam Rasool vs Wali Dad Khan",
      "High Court ruling on appellant within criminal general matters",
      "Islamabad High Court criminal general decision for Ghulam Rasool against Wali Dad Khan",
      "Why did Ghulam Rasool approach the court about appellant?"
    ]
  },
  {
    "case_id": 302,
    "case_number": "Crl. Misc. 1/2023 Bail After Arrest (SB)",
    "title": "Naseem Ahmed vs The State",
    "queries": [
      "Case involving Naseem Ahmed and The State in Islamabad High Court",
      "Explain the judgment in Naseem Ahmed vs The State",
      "High Court ruling on arrest within banking matters",
      "Islamabad High Court banking decision for Naseem Ahmed against The State",
      "Why did Naseem Ahmed approach the court about arrest?"
    ]
  },
  {
    "case_id": 303,
    "case_number": "W.P. 1/2023 Tax & Banking Tax (SB)",
    "title": "M/s IESCO vs Additional Commissioner Inland Revenue",
    "queries": [
      "Case involving M/s IESCO and Additional Commissioner Inland Revenue in Islamabad High Court",
      "Explain the judgment in M/s IESCO vs Additional Commissioner Inland Revenue",
      "High Court ruling on article 199 within company matters",
      "Islamabad High Court company decision for M/s IESCO against Additional Commissioner Inland Revenue",
      "Why did M/s IESCO approach the court about article 199?"
    ]
  },
  {
    "case_id": 313,
    "case_number": "C.O.S. 1/2022 Recovery (SB)",
    "title": "National Bank of Pakistan vs Rawal Institute of Health Science",
    "queries": [
      "Case involving National Bank of Pakistan and Rawal Institute of Health Science in Islamabad High Court",
      "Explain the judgment in National Bank of Pakistan vs Rawal Institute of Health Science",
      "Why did National Bank of Pakistan approach the court about bank?"
    ]
  },
  {
    "case_id": 314,
    "case_number": "C.O. 1/2022 Others (SB)",
    "title": "Kifayat Ullah Khan Bangash etc vs Silk Bank Ltd",
    "queries": [
      "Case involving Kifayat Ullah Khan Bangash and Silk Bank Ltd in Islamabad High Court",
      "Explain the judgment in Kifayat Ullah Khan Bangash etc vs Silk Bank Ltd",
      "High Court ruling on company within company matters",
      "Islamabad High Court company decision for Kifayat Ullah Khan Bangash against Silk Bank Ltd",
      "Why did Kifayat Ullah Khan Bangash approach the court about company?"
    ]
  },
  {
    "case_id": 320,
    "case_number": "T.A. 1/2022 Civil (SB)",
    "title": "Naseer Chohan vs IDK Ventures",
    "queries": [
      "Case involving Naseer Chohan and IDK Ventures in Islamabad High Court",
      "Explain the judgment in Naseer Chohan vs IDK Ventures",
      "High Court ruling on application within labour matters",
      "Islamabad High Court labour decision for Naseer Chohan against IDK Ventures",
      "Why did Naseer Chohan approach the court about application?"
    ]
  },
  {
    "case_id": 321,
    "case_number": "SECP Appeal 1/2022 (SB)",
    "title": "Sadruddin Hashwani etc vs SECP",
    "queries": [
      "Case involving Sadruddin Hashwani and SECP in Islamabad High Court",
      "Explain the judgment in Sadruddin Hashwani etc vs SECP",
      "High Court ruling on appellants within company matters",
      "Islamabad High Court company decision for Sadruddin Hashwani against SECP",
      "Why did Sadruddin Hashwani approach the court about appellants?"
    ]
  },
  {
    "case_id": 322,
    "case_number": "P.S.L.A. 1/2022 Other (SB)",
    "title": "Shahid Amin Minhas vs The State",
    "queries": [
      "Case involving Shahid Amin Minhas and The State in Islamabad High Court",
      "Explain the judgment in Shahid Amin Minhas vs The State",
      "High Court ruling on acquittal within company matters",
      "Islamabad High Court company decision for Shahid Amin Minhas against The State",
      "Why did Shahid Amin Minhas approach the court about acquittal?"
    ]
  },
  {
    "case_id": 328,
    "case_number": "I.C.A. 1/2022 Writ (DB)",
    "title": "Engineer Muhammad Zubair vs FOP",
    "queries": [
      "Case involving Engineer Muhammad Zubair and FOP in Islamabad High Court",
      "Explain the judgment in Engineer Muhammad Zubair vs FOP",
      "High Court ruling on appellant within constitutional matters",
      "Islamabad High Court constitutional decision for Engineer Muhammad Zubair against FOP",
      "Why did Engineer Muhammad Zubair approach the court about appellant?"
    ]
  },
  {
    "case_id": 336,
    "case_number": "Crl. Appeal 1/2022 Against Convct. PPC Upto 7 years (DB)",
    "title": "Gul Taj vs The State",
    "queries": [
      "Case involving Gul Taj and The State in Islamabad High Court",
      "Explain the judgment in Gul Taj vs The State",
      "High Court ruling on appellant within banking matters",
      "Islamabad High Court banking decision for Gul Taj against The State",
      "Why did Gul Taj approach the court about appellant?"
    ]
  },
  {
    "case_id": 337,
    "case_number": "W.P. 1/2022 Misc. Other (SB)",
    "title": "Gezhouba Wah Nobel Blasting Pvt Ltd vs FBR",
    "queries": [
      "Case involving Gezhouba Wah Nobel Blasting Pvt Ltd and FBR in Islamabad High Court",
      "Explain the judgment in Gezhouba Wah Nobel Blasting Pvt Ltd vs FBR",
      "High Court ruling on advocate within tax matters",
      "Islamabad High Court tax decision for Gezhouba Wah Nobel Blasting Pvt Ltd against FBR",
      "Why did Gezhouba Wah Nobel Blasting Pvt Ltd approach the court about advocate?"
    ]
  },
  {
    "case_id": 343,
    "case_number": "C.M. A 1/2021 (DB)",
    "title": "M/s Utility Stores Corporation of Pakistan vs NICL",
    "queries": [
      "Case involving M/s Utility Stores Corporation of Pakistan and NICL in Islamabad High Court",
      "Explain the judgment in M/s Utility Stores Corporation of Pakistan vs NICL",
      "High Court ruling on accrued within company matters",
      "Islamabad High Court company decision for M/s Utility Stores Corporation of Pakistan against NICL",
      "Why did M/s Utility Stores Corporation of Pakistan approach the court about accrued?"
    ]
  },
  {
    "case_id": 348,
    "case_number": "Complaint 1/2021 (LB)",
    "title": "The Registrar, Islamabad High Court, Islamabad vs Naseer Ahmed Kayani, Advocate and others",
    "queries": [
      "Case involving The Registrar, Islamabad High Court, Islamabad and Naseer Ahmed Kayani, Advocate and others in Islamabad High Court",
      "Explain the judgment in The Registrar, Islamabad High Court, Islamabad vs Naseer Ahmed Kayani, Advocate and others",
      "High Court ruling on advocate within constitutional matters",
      "Islamabad High Court constitutional decision for The Registrar, Islamabad High Court, Islamabad against Naseer Ahmed Kayani, Advocate and others",
      "Why did The Registrar, Islamabad High Court, Islamabad approach the court about advocate?"
    ]
  },
  {
    "case_id": 353,
    "case_number": "E.F.A. 1/2021 Banking (SB)",
    "title": "Mst. Abida Zakir vs Raja Aman Ullah Khan",
    "queries": [
      "Case involving Mst. Abida Zakir and Raja Aman Ullah Khan in Islamabad High Court",
      "Explain the judgment in Mst. Abida Zakir vs Raja Aman Ullah Khan",
      "High Court ruling on advocate within criminal general matters",
      "Islamabad High Court criminal general decision for Mst. Abida Zakir against Raja Aman Ullah Khan",
      "Why did Mst. Abida Zakir approach the court about advocate?"
    ]
  },
  {
    "case_id": 356,
    "case_number": "CR 1/2021 Against Judgement & Decree (SB)",
    "title": "Muhammad Hafeez etc vs Ali Asghar alias Aksar Khan",
    "queries": [
      "Case involving Muhammad Hafeez and Ali Asghar alias Aksar Khan in Islamabad High Court",
      "Explain the judgment in Muhammad Hafeez etc vs Ali Asghar alias Aksar Khan",
      "High Court ruling on article 199 within constitutional matters",
      "Islamabad High Court constitutional decision for Muhammad Hafeez against Ali Asghar alias Aksar Khan",
      "Why did Muhammad Hafeez approach the court about article 199?"
    ]
  },
  {
    "case_id": 359,
    "case_number": "T.A. 1/2021 Civil (SB)",
    "title": "Momina Rafique vs Muhammad Irfan",
    "queries": [
      "Case involving Momina Rafique and Muhammad Irfan in Islamabad High Court",
      "Explain the judgment in Momina Rafique vs Muhammad Irfan",
      "High Court ruling on counsel within property matters",
      "Islamabad High Court property decision for Momina Rafique against Muhammad Irfan",
      "Why did Momina Rafique approach the court about counsel?"
    ]
  },
  {
    "case_id": 363,
    "case_number": "Enfrc. Pet. 1/2021 (SB)",
    "title": "Saul Isreal Radunski vs Shah Zaman Khan",
    "queries": [
      "Case involving Saul Isreal Radunski and Shah Zaman Khan in Islamabad High Court",
      "Explain the judgment in Saul Isreal Radunski vs Shah Zaman Khan",
      "High Court ruling on applicant within criminal bail matters",
      "Islamabad High Court criminal bail decision for Saul Isreal Radunski against Shah Zaman Khan",
      "Why did Saul Isreal Radunski approach the court about applicant?"
    ]
  },
  {
    "case_id": 364,
    "case_number": "F.A.O. 3/2024 Against Order (SB)",
    "title": "FGEHA vs Aneeza Fatima and another",
    "queries": [
      "Case involving FGEHA and Aneeza Fatima and another in Islamabad High Court",
      "Explain the judgment in FGEHA vs Aneeza Fatima and another",
      "Why did FGEHA approach the court about appellant?"
    ]
  },
  {
    "case_id": 365,
    "case_number": "R.A. 29/2025 Writ (DB)",
    "title": "ALL PAKISTAN PAPER vs FOP",
    "queries": [
      "Case involving ALL PAKISTAN PAPER and FOP in Islamabad High Court",
      "Explain the judgment in ALL PAKISTAN PAPER vs FOP",
      "High Court ruling on applicant within company matters",
      "Islamabad High Court company decision for ALL PAKISTAN PAPER against FOP",
      "Why did ALL PAKISTAN PAPER approach the court about applicant?"
    ]
  }
]